app/controllers/user_items_controller.rb

SELECT "user_items".* FROM "user_items"
---
    def index
        user_items = UserItem.all