app/controllers/vapes_controller.rb

    def index
        vapes = Vape.all
---
SELECT "vapes".* FROM "vapes"

    def show
        vape = Vape.find(params[:id])
---
SELECT "vapes".* FROM "vapes" WHERE "vapes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        vape = Vape.create!(vape_params)
---
INSERT INTO "vapes" ("name", "price", "image_url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"