app/controllers/vape_reviews_controller.rb

SELECT "vape_reviews".* FROM "vape_reviews"
---
    def index
        vape_reviews = VapeReview.all

SELECT "vape_reviews".* FROM "vape_reviews" WHERE "vape_reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        vape_reviews = VapeReview.find(params[:id])

SELECT "vape_reviews".* FROM "vape_reviews" WHERE "vape_reviews"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "vape_reviews" SET "rating" = $1, "updated_at" = $2 WHERE "vape_reviews"."id" = $3  [["rating", 5], ["updated_at", "2022-10-29 01:40:16.413658"], ["id", 18]]
---
    def update
        vape_reviews = VapeReview.find(params[:id])
        vape_reviews.update!(vape_reviews_params)

INSERT INTO "vape_reviews" ("user_id", "vape_id", "rating", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["vape_id", 1], ["rating", 5], ["comment", "asdf"], ["created_at", "2022-10-28 04:57:58.852152"], ["updated_at", "2022-10-28 04:57:58.852152"]]
---
    def create
        vape_reviews = VapeReview.create!(vape_reviews_params)

SELECT "vape_reviews".* FROM "vape_reviews" WHERE "vape_reviews"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "vape_reviews" WHERE "vape_reviews"."id" = $1  [["id", 12]]
---
    def destroy
        vape_reviews = VapeReview.find(params[:id])
        vape_reviews.destroy

SELECT "vape_reviews".* FROM "vape_reviews" WHERE "vape_reviews"."vape_id" = $1 LIMIT $2  [["vape_id", 5], ["LIMIT", 1]]
---
    def get_vape_reviews
        vape_reviews = VapeReview.where(vape_id: params[:vape_id]).all

SELECT "vape_reviews".* FROM "vape_reviews" WHERE "vape_reviews"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def get_user_vape_reviews
        vape_reviews = VapeReview.find_by(user_id: params[:user_id])